In [ ]:
import pandas as pd
import numpy as np

 1. Wczytaj zbiór danych Titanic (Lab2)

In [ ]:
data = pd.read_csv("C:/Users/acer/Desktop/Geoinformatyka/Wstęp do uczenia maszynowego/Lab2/dane.csv")

2. Dokonaj wstępnej inspekcji pierwszych 20 wierszy. Co widzisz?
Zbiór danych ma 14 kolumn, pojawiają się pytajniki w danych, które sugerują brakujące wartości

In [ ]:
data.head(20)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48,0,0,19952,26.55,E12,S,3,?,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63,1,0,13502,77.9583,D7,S,10,?,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39,0,0,112050,0,A36,S,?,?,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53,2,0,11769,51.4792,C101,S,D,?,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71,0,0,PC 17609,49.5042,?,C,?,22,"Montevideo, Uruguay"
10,1,0,"Astor, Col. John Jacob",male,47,1,0,PC 17757,227.525,C62 C64,C,?,124,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18,1,0,PC 17757,227.525,C62 C64,C,4,?,"New York, NY"
12,1,1,"Aubart, Mme. Leontine Pauline",female,24,0,0,PC 17477,69.3,B35,C,9,?,"Paris, France"
13,1,1,"Barber, Miss. Ellen 'Nellie'",female,26,0,0,19877,78.85,?,S,6,?,?
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80,0,0,27042,30,A23,S,B,?,"Hessle, Yorks"
15,1,0,"Baumann, Mr. John D",male,?,0,0,PC 17318,25.925,?,S,?,?,"New York, NY"
16,1,0,"Baxter, Mr. Quigg Edmond",male,24,0,1,PC 17558,247.5208,B58 B60,C,?,?,"Montreal, PQ"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50,0,1,PC 17558,247.5208,B58 B60,C,6,?,"Montreal, PQ"
18,1,1,"Bazzani, Miss. Albina",female,32,0,0,11813,76.2917,D15,C,8,?,?
19,1,0,"Beattie, Mr. Thomson",male,36,0,0,13050,75.2417,C6,C,A,?,"Winnipeg, MN"

3. Sprawdź ile jest wartości brakujących używając funkcji pd.isnull().sum() oraz pd.isnull().mean.
Uwaga! Jest ich więcej niż 0. Czy zbiór danych należy zmodyfikować
przed użyciem w/w funkcji? Jeśli tak to jak? → wystarczy jedna linia kodu
W sprawozdaniu zapisz swoje obserwację i skomentuj % brakujących
danych w zależności od danej zmiennej.

In [ ]:
data.isnull().sum() # nie pokazuje wartosci null, bo trzeba zamienić ? na NaN
data = data.replace("?",np.NaN)

miss = data.isnull().sum()
miss_mean = data.isnull().mean()

zaobserwowano braki danych w kolumnach: age 20%, fare 0.07%, cabin 77%, embarked 0,15%, boat 62%, body 90% home.dest 43%. Są to bardzo duże braki danych

In [ ]:
null = data.isnull().sum().sum()
null
data.shape
procent_pustych = null/(1309*14)*100
procent_pustych

21.035687002073555

4. Zastanów się z jakim rodzajem braków danych masz do czynienia – całkowicie przypadkowe (MCAR), przypadkowe (MAR) czy nie
przypadkowe (MNAR). Swój wybór uzasadnij. Pamiętaj, że są to dane tragicznego rejsu, w którym spora część pasażerów nie przeżyła.
W celu uzasadnienia swoich obserwacji utwórz binarną zmienną dla brakujących wartości w danej kolumnie.
data['KolumnaNull’] = np.where(data['Kolumna'].isnull(), 1, 0)
Zauważ, że istnieje zmienna Survived, która jest zmienną binarną informującą o tym czy ktoś przeżył lub nie. Spróbuj zmapować
KolumnaNull ze zmienną Survived
data.groupby(['Survived'])['KolumnaNull'].mean()
Skomentuj wynik. Spróbuj zapisać powyższe dwie linijki kodu za pomocą tylko jednej.

In [ ]:
data['ageNull'] = np.where(data['age'].isnull(), 1, 0)
data['cabinNull'] = np.where(data['cabin'].isnull(), 1, 0)
data['boatNull'] = np.where(data['boat'].isnull(), 1, 0)
data['bodyNull'] = np.where(data['body'].isnull(), 1, 0)
data['fareNull'] = np.where(data['fare'].isnull(), 1, 0)
data['embarkedNull'] = np.where(data['embarked'].isnull(), 1, 0)
data['home.destNull'] = np.where(data['home.dest'].isnull(), 1, 0)

data

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,...,boat,body,home.dest,ageNull,cabinNull,boatNull,bodyNull,fareNull,embarkedNull,home.destNull
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,...,2,NaN,"St Louis, MO",0,0,0,1,0,0,0
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,...,11,NaN,"Montreal, PQ / Chesterville, ON",0,0,0,1,0,0,0
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,...,NaN,NaN,"Montreal, PQ / Chesterville, ON",0,0,1,1,0,0,0
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,...,NaN,135,"Montreal, PQ / Chesterville, ON",0,0,1,0,0,0,0
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,...,NaN,NaN,"Montreal, PQ / Chesterville, ON",0,0,1,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,...,NaN,328,NaN,0,1,1,0,0,0,1
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,...,NaN,NaN,NaN,1,1,1,1,0,0,1
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.225,NaN,...,NaN,304,NaN,0,1,1,0,0,0,1
1307,3,0,"Zakarian, Mr. Ortin",male,27,0,0,2670,7.225,NaN,...,NaN,NaN,NaN,0,1,1,1,0,0,1
1308,3,0,"Zimmerman, Mr. Leo",male,29,0,0,315082,7.875,NaN,...,NaN,NaN,NaN,0,1,1,1,0,0,1

In [ ]:
data.groupby(['survived'])['ageNull'].mean()
data.groupby(['survived'])['cabinNull'].mean()
data.groupby(['survived'])['boatNull'].mean()
data.groupby(['survived'])['bodyNull'].mean()
data.groupby(['survived'])['fareNull'].mean()
data.groupby(['survived'])['embarkedNull'].mean()
data.groupby(['survived'])['home.destNull'].mean()

survived
0    0.508035
1    0.306000
Name: home.destNull, dtype: float64

In [ ]:
data[['age','cabin','boat','body','fare','embarked','home.dest']].isnull().groupby(data['survived']).mean()

,age,cabin,boat,body,fare,embarked,home.dest
survived,,,,,,,
0,0.234858,0.873918,0.988875,0.850433,0.001236,0.000,0.508035
1,0.146000,0.614000,0.046000,1.000000,0.000000,0.004,0.306000

Dane dotyczą tragicznego rejsu, w których spora część pasażerów nie przeżyła, a dane są z dawnego okresu, dlatego braki danych nie są przypadkowe (MNAR), a świadczą raczej o trudności w dotarciu do określonych informacji. Nie powinniśmy ich usuwać, a raczej stworzyć z nich (braków) oddzielną kategorie.

5. Po powyższej analizie odpowiedz na pytanie w jaki sposób należy postąpić z brakującymi wartościami.

Dla danych brakujących, dotyczących wieku (age) można przyjąć średnią lub medianę. Dla cabin, boat, body, home.dest należy stworzyć
nową kategorię dla wartości brakujących, ponieważ tych wartości brakujących dla tych kolumn jest zbyt dużo. Dla fare i embarked % brakujących wartości jest mniejszy niż 5%, dlatego te wartości (rekordy) możemy usunąć, a braki uznać za całkowicie przypadkowe.